import matplotlib.pyplot as plt
import numpy as np
y1=[8,9,13,7,8,6,6,8,10,14,11,15,17,15,12,10,4,13,13,10,11,17,18,22,24,25,27,25,19,18,23,25,26,14,10,10,11,12,18,20,24,23]
    #2018-03-01到2018-04-11北京市最高气温（共42天）
list1=[]
for i in range(1,7):
    h=0
    for j in range(7*i-6,7*i+1):
        h=h+y1[j-1]
    p=h/7
    list1.append(p)#计算这42天每周的最高气温平均值
y1=list(list1)
x=[1,2,3,4,5,6]#1,2,3,4,5分别表示日期3-1~3-7,3-8~3-14,3-15~3-21,3-22~3-28,3-28~4-4,4-5~4-11
plt.plot(x,y1,'r-',linewidth=3,label='最高气温')


y2=[-3,-1,3,-2,-3,-3,-2,-4,-2,-2,0,3,5,6,-1,-1,0,1,2,-2,1,4,5,5,7,7,11,9,7,8,9,11,11,6,1,3,4,2,5,7,8,9]
     #2018-03-01到2018-04-11北京市最低气温（共42天）
list1=[]
for i in range(1,7):
    h=0
    for j in range(7*i-6,7*i+1):
        h=h+y2[j-1]
    p=h/7
    list1.append(p)#计算这42天每周的最低气温平均值
y2=tuple(list1)
x=(1,2,3,4,5,6)#1,2,3,4,5分别表示日期3-1~3-7,3-8~3-14,3-15~3-21,3-22~3-28,3-28~4-4,4-5~4-11
plt.plot(x,y2,'g--',linewidth=3,label='最低气温')
plt.ylim(-10,30)    #纵坐标天气温度的上，下限
plt.xlabel('时间')
plt.ylabel('平均气温')
plt.title('2018-03-01到2018-04-11北京市最高与最低气温变化图')
plt.legend(['最高气温','最低气温'])
plt.show()
